// ignore_for_file: non_constant_identifier_names

class MainArticleConstant {
  static final Catagories = [
    'تصميم',
    'مونتاج',
    'تحليل',
    'ادارة اعمال',
    'الخط',
  ];

  static final title = [
    'اتجاهات التصميم الجرافيكي لعام 2024 ',
    'اربح عملك باستخدام استراتيجيات جذب العملاء',
    'أفضل 5 دراسات حالة مذهلة لتجربة المستخدم',
    'اتجاهات الشعار لعام 2023 , علامتك التجارية بارزة!',
  ];

  static final paragraph = [
    '''
ومع تكامل تكنولوجيا الذكاء الاصطناعي والمنظور العالمي، 
يدفع المصممون الحدود ويضعون معايير جديدة. في هذا 
المقال، سوف نتعمق في أهم اتجاهات التصميم الجرافيكي 
التي من المقرر أن تسيطر على العام المقبل.

 ''',
    '''
 دعونا نواجه الأمر، إن جزءًا مهمًا من اكتساب العملاء
لمنتجك أو خدمتك هو تعريف المزيد من الأشخاص بها
بغض النظر عن مدى جودة منتجك، إذا لم يعرف أحد عنه
فلن يشتريه أحد. تقوم شركة B2B الخاصة بك بالبيع أمام
أكبر عدد ممكن من الأشخاص، كما أن الاستراتيجيات
مضمونة لمساعدتك في جذب عملاء محتملين جدد لمبيعات
B2B
 ''',
    '''
 دراسة حالة تجربة المستخدم هي فحص تفصيلي لمشروع 
تصميم تجربة المستخدم، حيث تعرض مهارات المصمم
وقدراته على حل المشكلات وتأثير عمله . إنه بمثابة محفظة 
توضح نهجًا يركز على المستخدم من خلال توثيق الأبحاث 
والشخصيات والتدفقات والاختبار. تشرح دراسات الحالة 
قرارات التصميم..
     ''',
    '''
 في المشهد الرقمي شديد التنافسية اليوم، يعد إنشاء هوية
علامة تجارية قوية أمرًا بالغ الأهمية لنجاح الشركات
الصغيرة والشركات الناشئة. الشعار المصمم جيدًا هو بمثابة
تمثيل مرئي لرسالتك، مما يترك انطباعًا دائمًا لدى العملاء 
ويمهد الطريق للاعتراف والثقة. سواء كنت مصممًا متمرسًا 
يبحث عن إلهام جديد أو شركة طموحة تهدف إلى إحداث
تأثير دائم، فهذه هي تذكرتك لتصميم المدينة الفاضلة. 
     '''
  ];
}
