class TrainingModel {
  final int trainId;
  final String imageUrl;
  final String title;
  final String description;
  final int field; // 0 programming , 1 design , 2 business , 3 marekting

  final List<String> topics;
  final List<String> trainingOutcomes;
  final List<String> details;

  const TrainingModel({
    required this.trainId,
    required this.imageUrl,
    required this.title,
    required this.description,
    required this.topics,
    required this.trainingOutcomes,
    required this.details,
    required this.field,
  });
}

List<TrainingModel> trainingsList = const [
  TrainingModel(
      trainId: 1,
      imageUrl:
          'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQLn1WqE4mGGJuRpy7KrxgEkgS5p682eow6sA&s',
      title: r" تدريب عن بعد لدى فوكال اكس بعنوان مصممUi\Ux ",
      description:
          ' تقدم شركة Focal x في سوريا فرصة تدريب عن بعد في مجال UI/UX. يعد هذا المجال مجالاً مهما وهو أسلوب حياة ليس فقط مهارة يتم اكتسابها يصبح المتدرب في نهاية'
          '   هذه التدريب قادرًا على تصميم الواجهات و دراسة تجربة المستخدم بطريقة احترافية تمكنه من دخول سوق العمل بقوة.',
      topics: [
        'المبادئ والأساسيات الأكاديمية في تصميم واجهات المواقع والتطبيقات.',
        'أركان تجربة المستخدم.',
        'دراسة الشرائح المستهدفة.',
        'تصاميم الأجهزة المختلفة.',
        'أنواع التصميم.',
      ],
      trainingOutcomes: [
        'شهادة من الشركة',
        'دعم فني واستشاري للمتدرب لمدة 3 اشهر بعد تخريجه',
        'توصية خطية ورقمية من الشركة',
      ],
      details: [
        'تدريب اونلاين ومتاح لكل الدول',
        'مدة التدريب 3 أشهر, يومين أسبوعيًا',
        '1000.000',
      ],
      field: 1),
  TrainingModel(
    trainId: 2,
    imageUrl:
        'https://miro.medium.com/v2/resize:fit:1400/1*LyZcwuLWv2FArOumCxobpA.png',
    title:
        "تدريب عن بعد لدى فوكال اكس بعنوان إتقان تطوير الويب باستخدام جافا سكريبت",
    description:
        'يُعد جافا سكريبت لغة برمجة أساسية لإنشاء مواقع ويب تفاعلية ديناميكية. في هذا التدريب عن بعد، ستتعلم كيفية برمجة جافا سكريبت من الصفر، بما في ذلك بناء واجهات المستخدم، والتفاعل مع DOM، واستخدام Ajax، والتعامل مع الأحداث، والمزيد. ستكتسب مهارات عملية قيمة تُمكّنك من تطوير مواقع ويب احترافية تلبي احتياجات العملاء.',
    topics: [
      'مقدمة إلى جافا سكريبت ونطاقاتها',
      'التعليمات البرمجية الأساسية: المتغيرات، والعمليات الحسابية، والشروط، والحلقات',
      'DOM (Document Object Model): التفاعل مع عناصر HTML',
      'بناء واجهات مستخدم تفاعلية باستخدام JavaScript',
      'Ajax: تحميل البيانات بشكل غير متزامن',
      'معالجة الأحداث: استجابة تفاعلات المستخدم',
      'مكتبات جافا سكريبت الشائعة',
    ],
    trainingOutcomes: [
      'شهادة من الشركة تؤكد إتقانك لجافا سكريبت',
      'مهارات عملية قوية في تطوير مواقع ويب ديناميكية',
      'قدرة على بناء واجهات مستخدم تفاعلية جاذبة',
      'فهم متعمق لمفاهيم البرمجة الأساسية',
    ],
    details: [
      'تدريب اونلاين ومتاح لكل الدول',
      'مدة التدريب 4 أشهر, يومين أسبوعيًا',
      '120000',
    ],
    field: 0,
  ),
  TrainingModel(
      trainId: 3,
      imageUrl:
          'https://miro.medium.com/v2/resize:fit:1200/1*m0H6-tUbW6grMlezlb52yw.png',
      title:
          r"تدريب عن بعد لدى فوكال اكس بعنوان تحليل البيانات باستخدام بايثون",
      description:
          'في عالم اليوم الذي يعتمد على البيانات، يُعد تحليل البيانات مهارة أساسية لجمع المعلومات وفهمها من مجموعات البيانات الضخمة. في هذا التدريب عن بعد، ستتعلم أساسيات تحليل البيانات باستخدام لغة برمجة بايثون، بما في ذلك تنظيف البيانات، ومعالجتها، وتحليلها، وبناء نماذج تنبؤية. ستكتسب مهارات قيمة تُمكّنك من تحويل البيانات إلى رؤى قابلة للتنفيذ تُساعد في اتخاذ قرارات أفضل في مختلف المجالات.',
      topics: [
        'مقدمة إلى تحليل البيانات وأهميته',
        'أساسيات لغة برمجة بايثون لتحليل البيانات',
        'تنظيف البيانات ومعالجتها: إعداد البيانات للتحليل',
        'تحليل البيانات الاستكشافي: فهم خصائص البيانات',
        'تحليل البيانات التنبئي: بناء نماذج للتنبؤ بالمستقبل',
        'التصور البياني: عرض البيانات بشكل مرئي',
        'التطبيقات العملية لتحليل البيانات في مختلف المجالات',
      ],
      trainingOutcomes: [
        'شهادة من الشركة تؤكد إتقانك لتحليل البيانات باستخدام بايثون',
        'مهارات عملية قوية في تنظيف البيانات ومعالجتها وتحليلها',
        'قدرة على بناء نماذج تنبؤية باستخدام بايثون',
        'فهم متعمق لتقنيات تحليل البيانات الحديثة',
      ],
      details: [
        'تدريب اونلاين ومتاح لكل الدول',
        'مدة التدريب 5 أشهر, يومين أسبوعيًا',
        '150000',
      ],
      field: 0),
  TrainingModel(
    trainId: 4,
    imageUrl:
        'https://media.licdn.com/dms/image/C4D12AQFkTUpGiT1Hew/article-cover_image-shrink_720_1280/0/1642729888483?e=2147483647&v=beta&t=KNAPGakiOxLTXR9YyZ_iTMhKBPZfQm05CSd7tedN3e8',
    title: "تدريب عن بعد لدى فوكال اكس بعنوان أساسيات التسويق الرقمي",
    description:
        'في هذا التدريب عن بعد، ستتعلم أساسيات التسويق الرقمي، بما في ذلك التسويق عبر محتوى الويب، وتحسين محركات البحث (SEO)، والتسويق عبر وسائل التواصل الاجتماعي، والتسويق بالبريد الإلكتروني، والإعلانات الرقمية. ستكتسب مهارات عملية قيمة تُمكّنك من إنشاء و تنفيذ حملات تسويقية ناجحة تزيد من وعي العلامة التجارية وجذب العملاء وتحقيق النمو.',
    topics: [
      'مقدمة إلى التسويق الرقمي ومفاهيمه الأساسية',
      'التسويق عبر محتوى الويب: إنشاء محتوى جذاب يجذب العملاء',
      'تحسين محركات البحث (SEO): تحسين موقعك الإلكتروني للظهور في نتائج البحث الأولى',
      'التسويق عبر وسائل التواصل الاجتماعي: بناء جمهور على المنصات الاجتماعية والتواصل مع العملاء',
      'التسويق بالبريد الإلكتروني: إنشاء حملات بريد إلكتروني فعالة لتحويل العملاء',
      'الإعلانات الرقمية: استخدام إعلانات Google و Facebook و Instagram للوصول إلى جمهور مستهدف',
      'تحليل البيانات واتخاذ القرارات: قياس نتائج حملاتك التسويقية وتحسينها باستمرار',
    ],
    trainingOutcomes: [
      'شهادة من الشركة تؤكد إتقانك لأساسيات التسويق الرقمي',
      'مهارات عملية قوية في إنشاء وتنفيذ حملات تسويقية ناجحة',
      'فهم متعمق لأدوات و تقنيات التسويق الرقمي الحديثة',
      'قدرة على تحليل البيانات واتخاذ قرارات تسويقية مستنيرة',
    ],
    details: [
      'تدريب اونلاين ومتاح لكل الدول',
      'مدة التدريب 6 أشهر, يومين أسبوعيًا',
      '1000000',
    ],
    field: 4,
  ),
  TrainingModel(
    trainId: 5,
    imageUrl:
        'https://imageio.forbes.com/specials-images/imageserve/633a774a842d06ecd68286ff/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds',
    title: r"تدريب عن بعد لدى فوكال اكس بعنوان أساسيات إدارة الأعمال",
    description:
        'في هذا التدريب عن بعد، ستتعلم أساسيات إدارة الأعمال، بما في ذلك التخطيط الاستراتيجي، والتسويق، والعمليات التشغيلية، والمالية، والموارد البشرية. ستكتسب مهارات عملية قيمة تُمكّنك من إدارة الأعمال بكفاءة وتحقيق النجاح.',
    topics: [
      'مقدمة إلى إدارة الأعمال ومفاهيمها الأساسية',
      'التخطيط الاستراتيجي: تحديد أهداف العمل ووضع خطة لتحقيقها',
      'التسويق: جذب العملاء وتحقيق المبيعات',
      'العمليات التشغيلية: إدارة العمليات اليومية للشركة بكفاءة',
      'المالية: إدارة الأموال والموارد المالية للشركة',
      'الموارد البشرية: توظيف وتدريب وإدارة الموظفين',
      'القيادة والتفاوض: قيادة فريق العمل وإدارة النزاعات بفعالية',
    ],
    trainingOutcomes: [
      'شهادة من الشركة تؤكد إتقانك لأساسيات إدارة الأعمال',
      'مهارات عملية قوية في إدارة مختلف جوانب العمل',
      'فهم متعمق لمبادئ وأدوات إدارة الأعمال الحديثة',
      'قدرة على اتخاذ قرارات إدارية سليمة',
    ],
    details: [
      'تدريب اونلاين ومتاح لكل الدول',
      'مدة التدريب 7 أشهر, يومين أسبوعيًا',
      '120000'
    ],
    field: 5,
  ),
];
